n = int(input())
ans = ''
words = {1: "один", 2: "два", 3: "три", 4: "четыре", 5: "пять",
         6: "шесть", 7: "семь", 8: "восемь", 9: "девять", 10: "десять", 11: "одиннадцать", 12: "двенадцать",
         13: "тринадцать",
         14: "четырнадцать", 15: "пятнадцать", 16: "шестнадцать", 17: "семнадцать", 18: "восемнадцать",
         19: "девятнадцать",
         20: "двадцать", 30: "тридцать", 40: "сорок", 50: "пятьдесят", 60: "шестьдесят", 70: "семьдесят",
         80: "восемьдесят", 90: "девяносто", 100: "сто", 200: "двести", 300: "тристо", 400: "четыреста",
         500: "пятьсот", 600: "шестьсот", 700: "семьсот", 800: "восемьсот", 900: "девятьсот"
         }
if n == 1000:
    ans = "одна тысяча"
else:
    if n >= 100:
        ans += words[(n // 100) * 100] + " "
        n %= 100
    if n >= 20:
        ans += words[(n // 10) * 10] + " "
        n %= 10
    if n > 0:
        ans += words[n] + " "
ans = ans.strip()
print(ans)
